<script lang="ts" setup></script>

<template>
  <div class="footer">
    <div class="container-sm">
      <div class="footer-wrapper">
        <div class="footer-logo-icons">
          <div class="footer__logo">
            <img src="/images/logo.png" alt="" />
          </div>
          <p class="footer-logo__text">
            Онлайн курсы премиум качества <br />
            от ведущих мастеров своей сферы
          </p>
          <div class="footer-socials">
            <a href="#" class="footer__icon">
              <svg
                width="20"
                height="20"
                viewBox="0 0 20 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M4 0C1.79086 0 0 1.79086 0 4V16C0 18.2091 1.79086 20 4 20H9.88077V13.1578H7.516V10.4913H9.88077V8.52491C9.88077 6.2427 11.3119 5 13.403 5C14.4047 5 15.265 5.07288 15.516 5.10528V7.49055L14.066 7.49129C12.929 7.49129 12.709 8.01767 12.709 8.7892V10.492H15.4207L15.0677 13.1585H12.709V20H16C18.2091 20 20 18.2091 20 16V4C20 1.79086 18.2091 0 16 0H4Z"
                  fill="white"
                  fill-opacity="0.9"
                />
              </svg>
            </a>
            <a href="#" class="footer__icon">
              <svg
                width="20"
                height="20"
                viewBox="0 0 20 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M10 0C7.28417 0 6.94417 0.0116667 5.8775 0.06C2.24583 0.226667 0.2275 2.24167 0.0608333 5.87667C0.0116667 6.94417 0 7.28417 0 10C0 12.7158 0.0116667 13.0567 0.06 14.1233C0.226667 17.755 2.24167 19.7733 5.87667 19.94C6.94417 19.9883 7.28417 20 10 20C12.7158 20 13.0567 19.9883 14.1233 19.94C17.7517 19.7733 19.775 17.7583 19.9392 14.1233C19.9883 13.0567 20 12.7158 20 10C20 7.28417 19.9883 6.94417 19.94 5.8775C19.7767 2.24917 17.7592 0.2275 14.1242 0.0608333C13.0567 0.0116667 12.7158 0 10 0ZM10 4.865C7.16417 4.865 4.865 7.16417 4.865 10C4.865 12.8358 7.16417 15.1358 10 15.1358C12.8358 15.1358 15.135 12.8367 15.135 10C15.135 7.16417 12.8358 4.865 10 4.865ZM10 13.3333C8.15917 13.3333 6.66667 11.8417 6.66667 10C6.66667 8.15917 8.15917 6.66667 10 6.66667C11.8408 6.66667 13.3333 8.15917 13.3333 10C13.3333 11.8417 11.8408 13.3333 10 13.3333ZM15.3383 3.4625C14.675 3.4625 14.1375 4 14.1375 4.6625C14.1375 5.325 14.675 5.8625 15.3383 5.8625C16.0008 5.8625 16.5375 5.325 16.5375 4.6625C16.5375 4 16.0008 3.4625 15.3383 3.4625Z"
                  fill="white"
                  fill-opacity="0.9"
                />
              </svg>
            </a>
            <a href="#" class="footer__icon">
              <svg
                width="20"
                height="16"
                viewBox="0 0 20 16"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M1.18622 6.96816C1.18622 6.96816 9.74445 3.45586 12.7126 2.21909C13.8504 1.72443 17.709 0.141361 17.709 0.141361C17.709 0.141361 19.49 -0.551171 19.3415 1.13076C19.292 1.82336 18.8963 4.24733 18.5006 6.86923C17.9069 10.5795 17.2638 14.6359 17.2638 14.6359C17.2638 14.6359 17.1649 15.7738 16.3239 15.9716C15.4829 16.1695 14.0977 15.2791 13.8504 15.0812C13.6525 14.9328 10.1402 12.7066 8.85399 11.6183C8.50769 11.3215 8.11195 10.7279 8.90342 10.0353C10.6844 8.40279 12.8115 6.37456 14.0977 5.08836C14.6914 4.49469 15.285 3.10956 12.8115 4.79149C9.29922 7.21553 5.83635 9.49113 5.83635 9.49113C5.83635 9.49113 5.04482 9.98579 3.56075 9.54056C2.07662 9.09539 0.345185 8.50173 0.345185 8.50173C0.345185 8.50173 -0.842013 7.75969 1.18622 6.96816Z"
                  fill="white"
                  fill-opacity="0.9"
                />
              </svg>
            </a>
            <a href="#" class="footer__icon">
              <svg
                width="20"
                height="15"
                viewBox="0 0 20 15"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M16.3458 0.153438C13.3425 -0.0515623 6.65333 -0.050729 3.65417 0.153438C0.406667 0.375104 0.0241667 2.33677 0 7.5001C0.0241667 12.6543 0.403333 14.6243 3.65417 14.8468C6.65417 15.0509 13.3425 15.0518 16.3458 14.8468C19.5933 14.6251 19.9758 12.6634 20 7.5001C19.9758 2.34594 19.5967 0.375938 16.3458 0.153438ZM7.5 10.8334V4.16677L14.1667 7.49427L7.5 10.8334Z"
                  fill="white"
                  fill-opacity="0.9"
                />
              </svg>
            </a>
          </div>
        </div>
        <ul class="footer-links">
          <h6 class="footer-links__title">Все курсы</h6>
          <li class="footer__link">
            <a href="#" class="link">Все курсы</a>
          </li>
          <li class="footer__link"><a href="#" class="link">Скоро</a></li>
          <li class="footer__link"><a href="#" class="link">Поиск</a></li>
          <li class="footer__link"><a href="#" class="link">Блог</a></li>
        </ul>
        <ul class="footer-links">
          <h6 class="footer-links__title">Формальности</h6>
          <li class="footer__link">
            <a href="#" class="link">Формальности</a>
          </li>
          <li class="footer__link">
            <a href="#" class="link">Условия использования</a>
          </li>
          <li class="footer__link">
            <a href="#" class="link">Политикой конф.</a>
          </li>
          <li class="footer__link"><a href="#" class="link">Контакты</a></li>
          <li class="footer__link">
            <a href="#" class="link">Чат с поддержкой</a>
          </li>
          <li class="footer__link"><a href="#" class="link">Оплата</a></li>
        </ul>
        <div class="footer-links btn">
          <h6 class="footer-links__title">Все курсы</h6>
          <h5 class="footer-links__subtitle">
            Новости, анонсы и скидки <br />
            в нашем телеграме
          </h5>
          <button class="footer__btn">
            <svg
              width="20"
              height="16"
              viewBox="0 0 20 16"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M1.68619 6.96816C1.68619 6.96816 10.2444 3.45586 13.2126 2.21909C14.3504 1.72443 18.209 0.141361 18.209 0.141361C18.209 0.141361 19.9899 -0.551171 19.8415 1.13076C19.792 1.82336 19.3963 4.24733 19.0005 6.86923C18.4069 10.5795 17.7638 14.6359 17.7638 14.6359C17.7638 14.6359 17.6648 15.7738 16.8239 15.9716C15.9829 16.1695 14.5977 15.2791 14.3504 15.0812C14.1525 14.9328 10.6402 12.7066 9.35396 11.6183C9.00766 11.3215 8.61192 10.7279 9.40339 10.0353C11.1843 8.40279 13.3115 6.37456 14.5977 5.08836C15.1914 4.49469 15.785 3.10956 13.3115 4.79149C9.79919 7.21553 6.33632 9.49113 6.33632 9.49113C6.33632 9.49113 5.54479 9.98579 4.06072 9.54056C2.57659 9.09539 0.845155 8.50173 0.845155 8.50173C0.845155 8.50173 -0.342044 7.75969 1.68619 6.96816Z"
                fill="white"
                fill-opacity="0.9"
              />
            </svg>
            <span>Перейти</span>
          </button>
        </div>
      </div>
      <div class="footer-sub-items">
        <div class="footer-sud__logo">
          <img src="/images/logo.png" alt="" />
        </div>
        <span class="footer-sub__date">© 2021 TopBreyns</span>
        <p class="footer-sub__security">
          <svg
            width="14"
            height="19"
            viewBox="0 0 14 19"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M11.997 6.66378H11.1637V4.99711C11.1637 2.69711 9.29705 0.830444 6.99705 0.830444C4.69705 0.830444 2.83038 2.69711 2.83038 4.99711V6.66378H1.99705C1.08038 6.66378 0.330383 7.41378 0.330383 8.33044V16.6638C0.330383 17.5804 1.08038 18.3304 1.99705 18.3304H11.997C12.9137 18.3304 13.6637 17.5804 13.6637 16.6638V8.33044C13.6637 7.41378 12.9137 6.66378 11.997 6.66378ZM4.49705 6.66378V4.99711C4.49705 3.61378 5.61372 2.49711 6.99705 2.49711C8.38038 2.49711 9.49705 3.61378 9.49705 4.99711V6.66378H4.49705Z"
              fill="white"
              fill-opacity="0.2"
            />
          </svg>
          Secured with SSL
        </p>
      </div>
    </div>
  </div>
</template>

<style lang="scss" src="./footerApp.scss"></style>
